#include "Mesh.h"

Mesh Mesh::CreateCube()
{
    Mesh mesh;

    mesh._vertices =
    {
        {-1.0f, -1.0f, -1.0f}, 
        { 1.0f, -1.0f, -1.0f}, 
        { 1.0f,  1.0f, -1.0f}, 
        {-1.0f,  1.0f, -1.0f}, 

        {-1.0f, -1.0f,  1.0f}, 
        { 1.0f, -1.0f,  1.0f}, 
        { 1.0f,  1.0f,  1.0f}, 
        {-1.0f,  1.0f,  1.0f}  
    };

    /* 법선벡터를 결정할 Triangles 인덱스 순서 */
    mesh._triangles =
    {
        // 앞
        {{0, 3, 2}},
        {{0, 2, 1}},
        // 뒤
        {{4, 5, 6}},
        {{4, 6, 7}},
        // 왼쪽
        {{0, 4, 7}},
        {{0, 7, 3}},
        // 오른쪽
        {{1, 2, 6}},
        {{1, 6, 5}},
        // 아래
        {{0, 1, 5}},
        {{0, 5, 4}},
        // 위
        {{3, 7, 6}},
        {{3, 6, 2}}
    };

    return mesh;
}